driver-tests/bpelse/assign/AssignNamespaces/src/QNameAssignment.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="QNameAssignment" targetNamespace="http://j2ee.netbeans.org/wsdl/QNameAssignment"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/QNameAssignment" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="QNameAssignmentOperationRequest">
        <part name="qNamePart" type="xsd:QName"/>
    </message>
    <message name="QNameAssignmentOperationReply">
        <part name="qNamePart" type="xsd:QName"/>
    </message>
    <portType name="QNameAssignmentPortType">
        <wsdl:operation name="QNameAssignmentOperation">
            <wsdl:input name="input1" message="tns:QNameAssignmentOperationRequest"/>
            <wsdl:output name="output1" message="tns:QNameAssignmentOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="QNameAssignmentBinding" type="tns:QNameAssignmentPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="QNameAssignmentOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/QNameAssignment"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/QNameAssignment"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="QNameAssignmentService">
        <wsdl:port name="QNameAssignmentPort" binding="tns:QNameAssignmentBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/QNameAssignmentService/QNameAssignmentPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="QNameAssignment1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="QNameAssignmentPortTypeRole" portType="tns:QNameAssignmentPortType"/>
    </plnk:partnerLinkType>
</definitions>
