driver-tests/bpelse/assign/AssignNamespacesJBI/test/partAsQName5/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <qnam:QNameAssignmentOperation xmlns:qnam="http://j2ee.netbeans.org/wsdl/QNameAssignment">
      <qNamePart>qnam:someValue</qNamePart>
    </qnam:QNameAssignmentOperation>
  </soapenv:Body>
</soapenv:Envelope>