driver-tests/bpelse/assign/AssignNamespacesJBI/test/partAsQName2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:qnam="http://j2ee.netbeans.org/wsdl/QNameAssignment">
  <soapenv:Body xmlns:prefix="http://j2ee.netbeans.org/prefix">
    <qnam:QNameAssignmentOperation>
      <qNamePart>prefix:someValue</qNamePart>
    </qnam:QNameAssignmentOperation>
  </soapenv:Body>
</soapenv:Envelope>